QA output created by 985
== Finding dmcache metrics
== Testing dmcache metrics
dbpmda> open pipe $PCP_PYTHON_PROG $PCP_PMDAS_DIR/dmcache/pmdadmcache.python
Start python PMDA: $PCP_PYTHON_PROG $PCP_PMDAS_DIR/dmcache/pmdadmcache.python
dbpmda> getdesc on
dbpmda> instance 129.0
pmInDom: 129.0
[  0] inst: 0 name: "dmcacheN"
[  1] inst: 1 name: "dmcacheN"
dbpmda> desc dmcache.size
PMID: 129.0.0
    Data Type: 64-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: discrete  Units: Kbyte
dbpmda> desc dmcache.metadata.block_size
PMID: 129.0.1
    Data Type: 32-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: discrete  Units: byte
dbpmda> desc dmcache.metadata.used
PMID: 129.0.2
    Data Type: 64-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: instant  Units: Kbyte
dbpmda> desc dmcache.metadata.total
PMID: 129.0.3
    Data Type: 64-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: discrete  Units: Kbyte
dbpmda> desc dmcache.cache.block_size
PMID: 129.0.4
    Data Type: 32-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: discrete  Units: byte
dbpmda> desc dmcache.cache.used
PMID: 129.0.5
    Data Type: 64-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: instant  Units: Kbyte
dbpmda> desc dmcache.cache.total
PMID: 129.0.6
    Data Type: 64-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: discrete  Units: Kbyte
dbpmda> desc dmcache.read_hits
PMID: 129.0.7
    Data Type: 32-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: counter  Units: count
dbpmda> desc dmcache.read_misses
PMID: 129.0.8
    Data Type: 32-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: counter  Units: count
dbpmda> desc dmcache.write_hits
PMID: 129.0.9
    Data Type: 32-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: counter  Units: count
dbpmda> desc dmcache.write_misses
PMID: 129.0.10
    Data Type: 32-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: counter  Units: count
dbpmda> desc dmcache.demotions
PMID: 129.0.11
    Data Type: 32-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: counter  Units: count
dbpmda> desc dmcache.promotions
PMID: 129.0.12
    Data Type: 32-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: counter  Units: count
dbpmda> desc dmcache.dirty
PMID: 129.0.13
    Data Type: 64-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: instant  Units: Kbyte
dbpmda> desc dmcache.io_mode_code
PMID: 129.0.14
    Data Type: 32-bit unsigned int  InDom: 129.0 0x20400000
    Semantics: discrete  Units: none
dbpmda> desc dmcache.io_mode
PMID: 129.1.0
    Data Type: string  InDom: 129.0 0x20400000
    Semantics: discrete  Units: none
dbpmda> fetch dmcache.size
PMID(s): 129.0.0
pmResult ... numpmid: 1
  129.0.0 (<noname>): numval: 2 valfmt: 1 vlist[]:
    inst [0 or ???] value SIZE
    inst [1 or ???] value SIZE
dbpmda> fetch dmcache.metadata.block_size
PMID(s): 129.0.1
pmResult ... numpmid: 1
  129.0.1 (<noname>): numval: 2 valfmt: 0 vlist[]:
    inst [0 or ???] value 4096
    inst [1 or ???] value 4096
dbpmda> fetch dmcache.metadata.used
PMID(s): 129.0.2
pmResult ... numpmid: 1
  129.0.2 (<noname>): numval: 2 valfmt: 1 vlist[]:
    inst [0 or ???] value 1156
    inst [1 or ???] value 1156
dbpmda> fetch dmcache.metadata.total
PMID(s): 129.0.3
pmResult ... numpmid: 1
  129.0.3 (<noname>): numval: 2 valfmt: 1 vlist[]:
    inst [0 or ???] value 3350528
    inst [1 or ???] value 3350528
dbpmda> fetch dmcache.cache.block_size
PMID(s): 129.0.4
pmResult ... numpmid: 1
  129.0.4 (<noname>): numval: 2 valfmt: 0 vlist[]:
    inst [0 or ???] value 262144
    inst [1 or ???] value 262144
dbpmda> fetch dmcache.cache.used
PMID(s): 129.0.5
pmResult ... numpmid: 1
  129.0.5 (<noname>): numval: 2 valfmt: 1 vlist[]:
    inst [0 or ???] value 18176
    inst [1 or ???] value 18176
dbpmda> fetch dmcache.cache.total
PMID(s): 129.0.6
pmResult ... numpmid: 1
  129.0.6 (<noname>): numval: 2 valfmt: 1 vlist[]:
    inst [0 or ???] value 30171136
    inst [1 or ???] value 30171136
dbpmda> fetch dmcache.read_hits
PMID(s): 129.0.7
pmResult ... numpmid: 1
  129.0.7 (<noname>): numval: 2 valfmt: 0 vlist[]:
    inst [0 or ???] value READ_HITS
    inst [1 or ???] value READ_HITS
dbpmda> fetch dmcache.read_misses
PMID(s): 129.0.8
pmResult ... numpmid: 1
  129.0.8 (<noname>): numval: 2 valfmt: 0 vlist[]:
    inst [0 or ???] value READ_MISSES
    inst [1 or ???] value READ_MISSES
dbpmda> fetch dmcache.write_hits
PMID(s): 129.0.9
pmResult ... numpmid: 1
  129.0.9 (<noname>): numval: 2 valfmt: 0 vlist[]:
    inst [0 or ???] value WRITE_HITS
    inst [1 or ???] value WRITE_HITS
dbpmda> fetch dmcache.write_misses
PMID(s): 129.0.10
pmResult ... numpmid: 1
  129.0.10 (<noname>): numval: 2 valfmt: 0 vlist[]:
    inst [0 or ???] value 0
    inst [1 or ???] value 0
dbpmda> fetch dmcache.demotions
PMID(s): 129.0.11
pmResult ... numpmid: 1
  129.0.11 (<noname>): numval: 2 valfmt: 0 vlist[]:
    inst [0 or ???] value 0
    inst [1 or ???] value 0
dbpmda> fetch dmcache.promotions
PMID(s): 129.0.12
pmResult ... numpmid: 1
  129.0.12 (<noname>): numval: 2 valfmt: 0 vlist[]:
    inst [0 or ???] value 71
    inst [1 or ???] value 71
dbpmda> fetch dmcache.dirty
PMID(s): 129.0.13
pmResult ... numpmid: 1
  129.0.13 (<noname>): numval: 2 valfmt: 1 vlist[]:
    inst [0 or ???] value 0
    inst [1 or ???] value 0
dbpmda> fetch dmcache.io_mode
PMID(s): 129.1.0
pmResult ... numpmid: 1
  129.1.0 (<noname>): numval: 2 valfmt: 1 vlist[]:
    inst [0 or ???] value WRITEMODE
    inst [1 or ???] value WRITEMODE
dbpmda> 
